Created without PITR

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.txtbook_postgres.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = "21:00-23:00"
      + ca_cert_identifier                    = "rds-ca-2019"
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "tvlk-dev-rds-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.7"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "txtbook-postgres-dfb2b44441c9efbb-final-snapshot"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "txtbook-postgres-dfb2b44441c9efbb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::460124681500:role/service-role/monitoring.rds.amazonaws.com/ServiceRoleForMonitoring_rds-enhanced-monitoring-cc141c88a11915"
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres13"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Description"   = "Postgres to store Tesla Extranet booking data"
          + "Environment"   = "production"
          + "ManagedBy"     = "terraform"
          + "Name"          = "txtbook-postgres-dfb2b44441c9efbb"
          + "OrgAWSBackup"  = "Disabled"
          + "ProductDomain" = "txt"
          + "Service"       = "txtbook"
        }
      + tags_all                              = {
          + "Description"   = "Postgres to store Tesla Extranet booking data"
          + "Environment"   = "production"
          + "ManagedBy"     = "terraform"
          + "Name"          = "txtbook-postgres-dfb2b44441c9efbb"
          + "OrgAWSBackup"  = "Disabled"
          + "ProductDomain" = "txt"
          + "Service"       = "txtbook"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-08a50f91da330aff2",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + address           = (known after apply)
  + arn               = (known after apply)
  + availability_zone = (known after apply)
  + endpoint          = (known after apply)
  + hosted_zone_id    = (known after apply)
  + id                = (known after apply)
  + resource_id       = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.txtbook_postgres.aws_db_instance.this: Creating...
module.txtbook_postgres.aws_db_instance.this: Still creating... [10s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [20s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [30s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [40s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [50s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [1m0s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [1m10s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [1m20s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [1m30s elapsed]
module.txtbook_postgres.aws_db_instance.this: Still creating... [1m40s elapsed]
```